tutorials/transport/multiSpeciesTransportFoam/Ketton/system/blockMeshDict1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (dx 0 0)
    (dx dy 0)
    (0 dy 0)
    (0 0 dz)
    (dx 0 dz)
    (dx dy dz)
    (0 dy dz)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (nx ny nz) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
  inlet 
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }

    
   outlet 
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }

   walls 
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
